tap "dagger/tap"
tap "felixkratz/formulae"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "brew-cask-completion"
brew "cmatrix"
brew "codex"
brew "colima", restart_service: :changed
brew "docker"
brew "docker-compose"
brew "emacs"
brew "fastfetch"
brew "ffmpeg"
brew "fish"
brew "gcc"
brew "htop"
brew "icu4c@76"
brew "jj"
brew "llvm"
brew "make"
brew "mise"
brew "navi"
brew "nushell"
brew "pipx"
brew "pixi"
brew "speedtest-cli"
brew "spicetify-cli"
brew "tectonic"
brew "thefuck"
brew "yt-dlp"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "1password-cli"
cask "betterdisplay"
cask "calibre"
cask "chatgpt-atlas"
cask "dagger/tap/container-use"
cask "excalidrawz"
cask "font-hack-nerd-font"
cask "font-zed-mono-nerd-font"
cask "jordanbaird-ice"
cask "obsidian"
cask "pearcleaner"
cask "podman-desktop"
cask "processing"
cask "stretchly"
cask "visual-studio-code@insiders"
cask "wezterm"
vscode "aaron-bond.better-comments"
vscode "al3xcubed.annotation-lens-cubed"
vscode "alefragnani.bookmarks"
vscode "alefragnani.separators"
vscode "antfu.icons-carbon"
vscode "anthhub.fat-json"
vscode "anysphere.pyright"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "astro-build.astro-vscode"
vscode "be5invis.vscode-custom-css"
vscode "bibhasdn.unique-lines"
vscode "bierner.docs-view"
vscode "bierner.markdown-mermaid"
vscode "brandonkirbyson.vscode-animations"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "charliermarsh.ruff"
vscode "chihiro718.whitespacepp"
vscode "christian-kohler.path-intellisense"
vscode "clemenspeters.format-json"
vscode "connorshea.vscode-test-explorer-status-bar"
vscode "continue.continue"
vscode "danielroedl.meld-diff"
vscode "davidbwaters.macos-modern-theme"
vscode "dfoxfranke.lunaria"
vscode "dominicvonk.parameter-hints"
vscode "donjayamanne.python-environment-manager"
vscode "dotiful.dotfiles-syntax-highlighting"
vscode "dsoloha.native-macos"
vscode "eamodio.gitlens"
vscode "eddjrn.e-ink"
vscode "eliasson.vscode-theme-boring"
vscode "equinusocio.moxer-icons"
vscode "exotech-code.theme-ibm-carbon-color-theme"
vscode "fabiospampinato.vscode-highlight"
vscode "foxundermoon.shell-format"
vscode "gerrnperl.outline-map"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "huseyn.pretty-oled"
vscode "ibm.output-colorizer"
vscode "jakeboone02.pgn"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "jmredfern.sort-selection"
vscode "jomeinaster.bracket-peek"
vscode "jonathan-yeung.mark-sharp"
vscode "kdl-org.kdl"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "lamartire.git-indicators"
vscode "leonidasiiv.google-sheets-equation-syntax-hightlighter"
vscode "mark-wiemer.vscode-autohotkey-plus-plus"
vscode "mde.select-highlight-minimap"
vscode "mechatroner.rainbow-csv"
vscode "medo64.highlight-ip"
vscode "mguellsegarra.highlight-on-copy"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "moalamri.inline-fold"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "mufanza.e-ink-theme"
vscode "naumovs.color-highlight"
vscode "nhoizey.gremlins"
vscode "njpwerner.autodocstring"
vscode "nopeslide.vscode-drawio-plugin-mermaid"
vscode "nortakales.date-hover-preview"
vscode "onatm.open-in-new-window"
vscode "pflannery.vscode-versionlens"
vscode "pranaygp.vscode-css-peek"
vscode "pucelle.vscode-css-navigation"
vscode "rafamel.subtle-brackets"
vscode "redhat.vscode-yaml"
vscode "redwan-hossain.skillavid-pure-black"
vscode "rlivings39.fzf-quick-open"
vscode "sainnhe.sonokai"
vscode "saoudrizwan.claude-dev"
vscode "semanticdiff.semanticdiff"
vscode "sjhuangx.vscode-scheme"
vscode "slevesque.shader"
vscode "spywhere.guides"
vscode "stneveadomi.grepc"
vscode "supermaven.supermaven"
vscode "syler.ignore"
vscode "tamasfe.even-better-toml"
vscode "tobiah.language-pde"
vscode "tomoki1207.pdf"
vscode "tomoki1207.selectline-statusbar"
vscode "tomrijndorp.find-it-faster"
vscode "trunk.io"
vscode "tumido.cron-explained"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "vivaxy.vscode-conventional-commits"
vscode "vue.volar"
vscode "vulfpeck.jetbrains-fleet-theme"
vscode "wattenberger.footsteps"
vscode "wraith13.bracket-lens"
vscode "wraith13.zoombar-vscode"
vscode "ybentz.scrapy-command-runner"
vscode "yummygum.city-lights-icon-vsc"
vscode "yummygum.city-lights-theme"
go "cmd/go"
go "cmd/gofmt"
cargo "atuin"
cargo "bandwhich"
cargo "bottom"
cargo "broot"
cargo "cargo-update"
cargo "choose"
cargo "du-dust"
cargo "dura"
cargo "eva"
cargo "eza"
cargo "fd-find"
cargo "macchina"
cargo "miniserve"
cargo "rxpipes"
cargo "starship"
cargo "topgrade"
cargo "trippy"
cargo "zellij"
cargo "zoxide"
